var array1=['アーケオス','アーケン','アーゴヨン','アーボ','アーボック','アーマーガア','アーマルド','アイアント','アオガラス','アギルダー','アクジキング','アグノム','アゲハント','アゴジムシ','アサナン','アシマリ','アシレーヌ','アズマオウ','アチャモ','アップリュー','アノプス','アバゴーラ','アブソル','アブリー','アブリボン','アマージョ','アマカジ','アママイコ','アマルス','アマルルガ','アメタマ','アメモース','アリアドス','アリゲイツ','アルセウス','アンノーン'
            ,'イーブイ','イエッサン','イオルブ','イシズマイ','イシツブテ','イシヘンジン','イトマル','イノムー','イベルタル','イルミーゼ','イワーク','イワパレス','イワンコ','インテレオン'
            ,'ウインディ','ウーラオス','ウールー','ウォーグル','ウオチルドン','ウオノラゴン','ウソッキー','ウソハチ','ウッウ','ウツドン','ウツボット','ウツロイド','ウデッポウ','ウパー','ウリムー','ウルガモス'
            ,'エアームド','エイパム','エースバーン','エーフィ','エテボース','エネコ','エネコロロ','エビワラー','エムリット','エモンガ','エリキテル','エルフーン','エルレイド','エレキッド','エレキブル','エレザード','エレズン','エレブー','エンテイ','エンニュート','エンブオー','エンペルト'
            ,'オオスバメ','オーダイル','オオタチ','オーベム','オーロット','オーロンゲ','オクタン','オコリザル','オシャマリ','オタチ','オタマロ','オトスパス','オドシシ','オドリドリ','オニゴーリ','オニシズクモ','オニスズメ','オニドリル','オノノクス','オノンド','オムスター','オムナイト','オンバーン','オンバット'
            ,'ガーディ','ガーメイル','カイオーガ','カイリキー','カイリュー','カイロス','カエンジシ','ガオガエン','カクレオン','カゲボウズ','カジッチュ','カジリガメ','カチコール','ガチゴラス','ガバイト','カバルドン','カビゴン','カプ・コケコ','カプ・テテフ','カブト','カブトプス','カプ・ブルル','ガブリアス','カブルモ','カプ・レヒレ','カポエラー','ガマガル','ガマゲロゲ','カマスジョー','カミツルギ','カムカメ','カメール','カメックス','カメテテ','ガメノデス','カモネギ','カラカラ','ガラガラ','カラサリス','カラナクシ','カラマネロ','カリキリ','ガルーラ','ガントル'
            ,'ギアル','ギガイアス','ギギアル','ギギギアル','キテルグマ','キノガッサ','キノココ','キバゴ','キバニア','キマワリ','ギモー','キモリ','キャタピー','キャモメ','ギャラドス','ギャロップ','キュウコン','キュレム','キュワワー','ギラティナ','キリキザン','キリンリキ','ギルガルド','キルリア','キレイハナ','キングドラ','キングラー'
            ,'クイタラン','クサイハナ','クスネ','クズモー','グソクムシャ','クチート','クヌギダマ','クマシュン','グラードン','グライオン','グライガー','グラエナ','クラブ','グランブル','クリムガン','クルマユ','クルミル','グレイシア','クレセリア','グレッグル','クレッフィ','クレベース','クロバット','クワガノン'
            ,'ケイコウオ','ケーシィ','ケケンカニ','ゲコガシラ','ケッキング','ゲッコウガ','ゲノセクト','ケムッソ','ケララッパ','ケルディオ','ケロマツ','ゲンガー','ケンタロス','ケンホロウ'
            ,'コアルヒー','コイキング','コイル','ゴウカザル','ゴーゴート','ゴース','ゴースト','コータス','ゴーリキー','コオリッポ','コクーン','ゴクリン','ココガラ','ココドラ','ココロモリ','コジョフー','コジョンド','コスモウム','コスモッグ','コソクムシ','コダック','ゴチミル','ゴチム','ゴチルゼル','コドラ','ゴニョニョ','コノハナ','コバルオン','ゴビット','コフーライ','コフキムシ','ゴマゾウ','コマタナ','コモルー','コラッタ','ゴリランダー','コリンク','ゴルーグ','ゴルダック','ゴルバット','ゴローニャ','ゴローン','コロトック','コロボーシ','コロモリ','ゴロンダ','コンパン','ゴンベ'
            ,'サーナイト','サイドン','サイホーン','サクラビス','サザンドラ','ザシアン','サシカマス','サダイジャ','サッチムシ','サナギラス','サニーゴ','サニゴーン','サボネア','ザマゼンタ','サマヨール','サメハダー','ザルード','サルノリ','サワムラー','ザングース','サンダー','サンダース','サンド','サンドパン'
            ,'シードラ','ジーランス','シェイミ','シェルダー','ジガルデ','シキジカ','ジグザグマ','シザリガー','ジジーロン','シシコ','シズクモ','ジバコイル','シビシラス','シビビール','シビルドン','ジヘッド','シママ','ジメレオン','ジャノビー','ジャラコ','ジャラランガ','ジャランゴ','ジャローダ','シャワーズ','シャンデラ','ジュカイン','ジュゴン','シュシュプ','ジュナイパー','シュバルゴ','ジュプトル','ジュペッタ','ジュラルドン','ジラーチ','シルヴァディ','シロデスナ','シンボラー'
            ,'スイクン','ズガイドス','スカタンク','ズガドーン','スカンプー','スコルピ','スターミー','ストライク','ストリンダー','スナバァ','スナヘビ','ズバット','スバメ','スピアー','スボミー','スリーパー','スリープ','ズルズキン','ズルッグ','スワンナ'
            ,'ゼクロム','セキタンザン','ゼニガメ','ゼブライカ','ゼラオラ','ゼルネアス','セレビィ'
            ,'ゾウドウ','ソーナノ','ソーナンス','ソルガレオ','ソルロック','ゾロア','ゾロアーク'
            ,'ダークライ','ダーテング','ダイオウドウ','ダイケンキ','ダイノーズ','タイプ：ヌル','タイレーツ','ダグトリオ','ダクマ','ダゲキ','ダストダス','タタッコ','ダダリン','タチフサグマ','タッツー','タツベイ','タテトプス','タネボー','ダブラン','タブンネ','タマゲタケ','タマザラシ','タマタマ','タマンタ','タルップル','ダルマッカ','ダンゴロ','タンドン','ダンバル'
            ,'チェリム','チェリンボ','チゴラス','チコリータ','チャーレム','チャオブー','チュリネ','チョボマキ','チョロネコ','チョンチー','チラーミィ','チラチーノ','チリーン','チルタリス','チルット'
            ,'ツタージャ','ツチニン','ツツケラ','ツボツボ','ツンデツンデ','ツンベアー'
            ,'ディアルガ','ディアンシー','ディグダ','テールナー','デオキシス','デカグース','デスカーン','デスバーン','デスマス','テッカグヤ','テッカニン','テッシード','テッポウオ','デデンネ','テブリム','テラキオン','デリバード','デルビル','デンジュモク','デンヂムシ','デンチュラ','デンリュウ'
            ,'ドータクン','ドードー','ドードリオ','ドーブル','ドーミラー','ドガース','ドククラゲ','ドクケイル','ドクロッグ','トゲキッス','トゲチック','トゲデマル','トゲピー','ドゴーム','ドサイドン','トサキント','ドジョッチ','ドダイトス','ドッコラー','ドデカバシ','ドテッコツ','トドグラー','トドゼルガ','ドヒドイデ','ドラパルト','ドラピオン','ドラミドロ','ドラメシヤ','トランセル','トリデプス','トリトドン','トリミアン','ドリュウズ','トルネロス','ドレディア','トロッゴン','ドロバンコ','トロピウス','ドロンチ','ドンカラス','ドンファン','ドンメル'
            ,'ナエトル','ナゲキ','ナゲツケサル','ナゾノクサ','ナックラー','ナッシー','ナットレイ','ナマケロ','ナマコブシ','ナマズン'
            ,'ニダンギル','ニドキング','ニドクイン','ニドラン♂','ニドラン♀','ニドリーナ','ニドリーノ','ニャース','ニャイキング','ニャオニクス','ニャスパー','ニャビー','ニャヒート','ニャルマー','ニューラ','ニョロゾ','ニョロトノ','ニョロボン','ニョロモ','ニンフィア'
            ,'ヌイコグマ','ヌオー','ヌケニン','ヌマクロー','ヌメイル','ヌメラ','ヌメルゴン'
            ,'ネイティ','ネイティオ','ネオラント','ネギガナイト','ネクロズマ','ネッコアラ','ネマシュ','ネンドール'
            ,'ノクタス','ノコッチ','ノズパス'
            ,'ハーデリア','パールル','バイウールー','バイバニラ','パウワウ','バオッキー','バオップ','ハガネール','ハギギシリ','バクーダ','バクオング','バクガメス','バクフーン','ハクリュー','バケッチャ','バシャーモ','ハスブレロ','ハスボー','バスラオ','バタフリー','バチュル','パチリス','バチンウニ','バチンキー','ハッサム','パッチール','パッチラゴン','パッチルドン','バッフロン','ハトーボー','バドレックス','バニプッチ','バニリッチ','ハネッコ','バネブー','ハハコモリ','ハピナス','ハブネーク','ハヤシガメ','パラス','パラセクト','ハリーセン','バリコオル','ハリテヤマ','ハリボーグ','ハリマロン','バリヤード','パルキア','バルキー','バルジーナ','パルシェン','パルスワン','バルチャイ','バルビート','バンギラス','ハンテール','バンバドロ','パンプジン'
            ,'ピィ','ビークイン','ビーダル','ヒードラン','ビードル','ピカチュウ','ピクシー','ビクティニ','ヒコザル','ピジョット','ピジョン','ピチュー','ビッパ','ピッピ','ヒドイデ','ヒトカゲ','ヒトツキ','ヒトデマン','ヒトモシ','ヒノアラシ','ヒノヤコマ','ヒバニー','ヒヒダルマ','ビビヨン','ビブラーバ','ヒポポタス','ヒマナッツ','ヒメグマ','ヒメンカ','ヒヤッキー','ヒヤップ','ビリジオン','ビリリダマ','ヒンバス','ピンプク'
            ,'ファイアロー','ファイヤー','フィオネ','ブイゼル','ブースター','フーディン','フーパ','ブーバー','ブーバーン','ブーピッグ','フェローチェ','フォクスライ','フォッコ','フォレトス','フカマル','フクスロー','プクリン','フシギソウ','フシギダネ','フシギバナ','フシデ','フタチマル','プテラ','ブニャット','ブビィ','ププリン','フラージェス','フライゴン','フラエッテ','プラスル','ブラッキー','フラベベ','フリーザー','フリージオ','ブリガロン','ブリザポス','ブリムオン','プリン','ブルー','プルリル','ブルンゲル','フレフワン','フローゼル','ブロスター','プロトーガ','フワライド','フワンテ'
            ,'ヘイガニ','ベイリーフ','ベトベター','ベトベトン','ベベノム','ヘラクロス','ペラップ','ペリッパー','ヘルガー','ペルシアン','ペロッパフ','ベロバー','ベロベルト','ペロリーム','ベロリンガ','ペンドラー'
            ,'ホイーガ','ホウオウ','ホエルオー','ホエルコ','ホーホー','ボーマンダ','ポカブ','ボクレー','ホシガリス','ボスゴドラ','ポチエナ','ポッタイシ','ポッチャマ','ポットデス','ポッポ','ポニータ','ポポッコ','ポリゴン','ポリゴン2','ポリゴンZ','ホルード','ボルケニオン','ボルトロス','ホルビー','ポワルン'
            ,'マーイーカ','マーシャドー','マイナン','マギアナ','マグカルゴ','マクノシタ','マグマッグ','マグマラシ','マケンカニ','マシェード','マスキッパ','マダツボミ','マタドガス','マッギョ','マッシブーン','マッスグマ','マナフィ','マニューラ','マネネ','マフォクシー','マホイップ','マホミル','ママンボウ','マメパト','マユルド','マラカッチ','マリル','マリルリ','マルノーム','マルマイン','マルヤクデ','マンキー','マンタイン','マンムー'
            ,'ミカルゲ','ミジュマル','ミズゴロウ','ミツハニー','ミニリュウ','ミネズミ','ミノマダム','ミノムッチ','ミブリム','ミミッキュ','ミミロップ','ミミロル','ミュウ','ミュウツー','ミルタンク','ミルホッグ','ミロカロス'
            ,'ムウマ','ムウマージ','ムーランド','ムクバード','ムクホーク','ムゲンダイナ','ムシャーナ','ムチュール','ムックル','ムンナ'
            ,'メェークル','メガニウム','メガヤンマ','メグロコ','メタグロス','メタモン','メタング','メッソン','メテノ','メノクラゲ','メブキジカ','メラルバ','メリープ','メルタン','メルメタル','メレシー','メロエッタ'
            ,'モウカザル','モグリュー','モクロー','モココ','モジャンボ','モスノウ','モノズ','モルフォン','モルペコ','モロバレル','モンジャラ','モンメン'
            ,'ヤクデ','ヤジロン','ヤトウモリ','ヤドキング','ヤドラン','ヤドン','ヤナッキー','ヤナップ','ヤバチャ','ヤブクロン','ヤミカラス','ヤミラミ','ヤヤコマ','ヤルキモノ','ヤレユータン','ヤングース','ヤンチャム','ヤンヤンマ'
            ,'ユキカブリ','ユキノオー','ユキハミ','ユキメノコ','ユキワラシ','ユクシー','ユニラン','ユレイドル','ユンゲラー'
            ,'ヨーギラス','ヨーテリー','ヨクバリス','ヨノワール','ヨマワル','ヨルノズク','ヨワシ'
            ,'ライコウ','ライチュウ','ライボルト','ラグラージ','ラクライ','ラッキー','ラッタ','ラティアス','ラティオス','ラビフット','ラブカス','ラプラス','ラフレシア','ラムパルド','ラランテス','ラルトス','ランクルス','ランターン','ランドロス','ランプラー'
            ,'リーシャン','リーフィア','リオル','リグレー','リザード','リザードン','リリーラ','リングマ'
            ,'ルージュラ','ルカリオ','ルガルガン','ルギア','ルクシオ','ルチャブル','ルナアーラ','ルナトーン','ルリリ','ルンパッパ'
            ,'レアコイル','レイスポス','レジアイス','レジエレキ','レジギガス','レジスチル','レジドラゴ','レシラム','レジロック','レックウザ','レディアン','レディバ','レドームシ','レパルダス','レントラー'
            ,'ローブシン','ロコン','ロズレイド','ロゼリア','ロトム'
            ,'ワカシャモ','ワシボン','ワタシラガ','ワタッコ','ワニノコ','ワルビアル','ワルビル','ワンパチ','ワンリキー'];
var i,ransu;
var all=[];
var flag=0;
var k=-1;
var point=0;
var lw1,lw2;
var countconst=19;
var win=0,lose=0;
var bre=()=>{
  flag=1;
  msg3.innerText='20秒経ちました。あなたの負けです！';
  msg2.innerText='\n';
  msg.innerText = '\n';
  lose=1;
  abortcd();
  checkButton.disabled = true
}
var count=()=>{
  byousu.innerText='残り'+countconst+'秒';
  countconst--;
}
function startTimer(){
  timerId=setTimeout(bre,20000);
}
function abortTimer(){
  clearTimeout(timerId);
}
function countdown(){
　　cdId=setInterval(count,1000);
}
function abortcd(){
  countconst=19;
  clearTimeout(cdId);
}
 function keydown_enter(){
   //console.log(7);
   //console.log('e'+window.event.keyCode);
    if(window.event.keyCode==13 && (lose!=1 && win!=1)){
      butotnClick();
    }
    else if(window.event.keyCode==9){
      //console.log(71);
      window.location.reload();
    }
 }

  function butotnClick(){
    if(point>=1){
      //console.log(4);
      abortTimer();
      abortcd();
      point=0;
    }
    if(win!=1){
    //console.log("startpoint"+point);
    countdown();
    startTimer();
  }

//プレイヤー側の挙動

   console.log(1);
    for(i=0;i<898;i++){
      console.log('a' +i );
      
      
    if(nameText.value==array1[i]){
      if(nameText.value.slice(-1)=='ン'){
        msg.innerText='最後に「ン」がついてしまいました。。。';
        all=all+array1[i]+'→';
      history.innerText='履歴   '+all;
        msg2.innerText='';
        lose=1;
        flag=1;
        checkButton.disabled = true
        break;
      }
      msg.innerText = 'あなたは"' + nameText.value + '"を繰り出した!';
      all=all+array1[i]+'→';
      history.innerText='履歴   '+all;
      //console.log(2);
      lw1=array1[i];
      lw1=array1[i].replace('ァ','ア');
          lw1=lw1.replace('ィ','イ');
          lw1=lw1.replace('ゥ','ウ');
          lw1=lw1.replace('ェ','エ');
          lw1=lw1.replace('ォ','オ');
          lw1=lw1.replace('ャ','ヤ');
          lw1=lw1.replace('ュ','ユ');
          lw1=lw1.replace('ョ','ヨ');
          if(lw1.slice(-1)=='2'){
            lw1='ポリゴンツー';
          }
          if(lw1.slice(-1)=='Z'){
            lw1='ポリゴンゼット';
          }
          if(lw1.slice(-1)=='♂'){
            lw1='ニドランオス';
          }
          if(lw1.slice(-1)=='♀'){
            lw1='ニドランメス';
          }
          array1[i]='ン';
      point=1;
      lose=0;
      break;
    }
    else {
      msg.innerText='間違っています→(' +nameText.value+ ')';
      //console.log(8+"point"+point);
      point=1;
      lose=1;
      msg2.innerText='';
    }
  }
  if(lose==1){
    checkButton.disabled = true
  }

    if( k!=-1 && lose==0){
      if(lw2.slice(-1)=='ー'){
        if(nameText.value.slice(0,1)!=lw2.substr(-2,1)){
          //console.log('q'+lw2 );
          //console.log('w'+nameText.value.slice(0,1));
          //console.log('e'+lw2.substr(-2,1));
          //console.log(6);
          msg.innerText='間違っています';
          point=1;
          lose=1;
          flag=1;
          checkButton.disabled = true
        }
      }
      else if(nameText.value.slice(0,1)!=lw2.slice(-1)){
      msg.innerText = '間違っています';
      //console.log(9+"point"+point);
      point=1;
      lose=1;
      flag=1;
      checkButton.disabled = true
      }
    }
  
//CPU側の挙動

   if(lose==0 && win==0){
        k=1;
        for(;;){
          ransu=Math.floor(Math.random()*897)
          //console.log('6'+array1[897]);
          //console.log('r'+ransu);
          //console.log('s'+array1[ransu]);
          lw2=array1[ransu];
          if(lw2.slice(-1)=='Z'){
            lw2='ポリゴンゼット';
          }
          if(lw2.slice(-1)=='♂'){
            lw2='ニドランオス';
          }
          if(lw2.slice(-1)=='♀'){
            lw2='ニドランメス';
          }
          lw2=lw2.replace('ァ','ア');
          lw2=lw2.replace('ィ','イ');
          lw2=lw2.replace('ゥ','ウ');
          lw2=lw2.replace('ェ','エ');
          lw2=lw2.replace('ォ','オ');
          lw2=lw2.replace('ャ','ヤ');
          lw2=lw2.replace('ュ','ユ');
          lw2=lw2.replace('ョ','ヨ');
          
//console.log(12);
//console.log('s'+lw2);
          if(lw1.slice(-1)=='ー'){
            if(lw2.slice(0,1)==lw1.substr(-2,1)){
              break;
            }
          }
          else if(lw2.slice(0,1)==lw1.slice(-1) && lose==0){
            break;
          }
   }

     //console.log('i' +i );
      
          msg2.innerText='相手は"'+ array1[ransu] +'"を繰り出した!';
          all=all+array1[ransu]+'→';
          history.innerText='履歴   '+all;
          
          //console.log('a'+lw2);
          
          if(lw2.slice(-1)=='ン'){
            msg4.innerText='相手は最後に「ン」がついてしまいました。あなたの勝利です!';
            win=1;
            flag=1;
            checkButton.disabled = true
          }
          array1[ransu]='ン';
          //console.log('a'+lw2);
    
  
      //console.log(3);

   }
  //console.log("checkpoint"+point);
  if(win==1 || lose==1){
    abortTimer();
    abortcd();
  
  }
  nameText.value='';
}



let nameText = document.getElementById('nameText');
let msg = document.getElementById('msg');
let msg2 = document.getElementById('msg2');
let msg3 = document.getElementById('msg3');
let msg4 = document.getElementById('msg4');
let history = document.getElementById('history');

let checkButton = document.getElementById('checkButton');
checkButton.addEventListener('click', butotnClick);